app/Controllers/Investigation/ConclusionController.php

    private function isAssignedToCase($caseId, $userId): bool
    {
        $db = \Config\Database::connect();
        $assignment = $db->table('case_assignments')
            ->where('case_id', $caseId)
            ->where('investigator_id', $userId)
            ->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `case_assignments`
WHERE `case_id` = '13'
AND `investigator_id` = '30'