app/Controllers/Investigation/EvidenceController.php

SELECT *
FROM `cases`
WHERE `cases`.`id` = '37'
---
    public function index($caseId = null)
    {
        if (!$caseId) {
            return $this->fail('Case ID is required', 400);
        }

        $caseModel = model('App\Models\CaseModel');
        $case = $caseModel->find($caseId);

SELECT `evidence`.*, `users`.`full_name` as `collected_by_name`
FROM `evidence`
LEFT JOIN `users` ON `users`.`id` = `evidence`.`collected_by`
WHERE `evidence`.`case_id` = '37'
ORDER BY `evidence`.`collected_at` DESC
---

        // Get all evidence for this case
        $evidenceModel = model('App\Models\EvidenceModel');
        $evidence = $evidenceModel->select('evidence.*, users.full_name as collected_by_name')
            ->join('users', 'users.id = evidence.collected_by', 'left')
            ->where('evidence.case_id', $caseId)
            ->orderBy('evidence.collected_at', 'DESC')
            ->findAll();

SELECT *
FROM `evidence`
WHERE `evidence`.`id` = '11'
---
    public function download($id = null)
    {
        $evidenceModel = model('App\Models\EvidenceModel');
        $evidence = $evidenceModel->find($id);

INSERT INTO `evidence_custody_log` (`evidence_id`, `action`, `performed_by`, `location`, `notes`, `witness_id`) VALUES (11, 'accessed', '30', NULL, 'Evidence file downloaded by user', NULL)
---
    private function logCustodyAction(int $evidenceId, string $action, ?string $notes = null, ?string $location = null, ?int $witnessId = null)
    {
        $db = \Config\Database::connect();
        $db->table('evidence_custody_log')->insert([
            'evidence_id' => $evidenceId,
            'action' => $action,
            'performed_by' => $this->request->userId,
            'location' => $location,
            'notes' => $notes,
            'witness_id' => $witnessId
        ]);