app/Controllers/Investigation/PersonController.php

    public function index()
    {
        $investigatorId = $this->request->userId;
        $db = \Config\Database::connect();

        // Get all persons from cases assigned to this investigator
        $persons = $db->table('persons p')
            ->select('p.*,
                COUNT(DISTINCT cp.case_id) as total_cases,
                COUNT(DISTINCT CASE WHEN ca.investigator_id = ' . $investigatorId . ' THEN cp.case_id END) as investigator_cases,
                cr.custody_status,
                cr.custody_location,
                GROUP_CONCAT(DISTINCT cp.party_role) as roles')
            ->join('case_parties cp', 'cp.person_id = p.id', 'inner')
            ->join('case_assignments ca', 'ca.case_id = cp.case_id', 'inner')
            ->join('custody_records cr', 'cr.person_id = p.id AND cr.custody_status IN ("in_custody", "bailed")', 'left')
            ->where('ca.investigator_id', $investigatorId)
            ->where('ca.status', 'active')
            ->groupBy('p.id')
            ->orderBy('investigator_cases', 'DESC')
            ->get()
            ->getResultArray();

        // Get detailed case information for each person
        foreach ($persons as &$person) {
            $person['cases'] = $db->table('cases c')
                ->select('c.id, c.case_number, c.crime_type, c.status, c.priority, c.created_at, cp.party_role')
                ->join('case_parties cp', 'cp.case_id = c.id')
                ->join('case_assignments ca', 'ca.case_id = c.id')
                ->where('cp.person_id', $person['id'])
                ->where('ca.investigator_id', $investigatorId)
                ->where('ca.status', 'active')
                ->get()
                ->getResultArray();

            // Get criminal history count (based on past cases where person was accused)
            $person['criminal_history_count'] = $db->table('cases c')
                ->join('case_parties cp', 'cp.case_id = c.id')
                ->where('cp.person_id', $person['id'])
                ->where('cp.party_role', 'accused')
                ->where('c.status', 'closed')
                ->countAllResults();
---
SELECT `p`.*, COUNT(DISTINCT cp.case_id) as total_cases, COUNT(DISTINCT CASE WHEN ca.investigator_id = 30 THEN cp.case_id END) as investigator_cases, `cr`.`custody_status`, `cr`.`custody_location`, GROUP_CONCAT(DISTINCT cp.party_role) as roles
FROM `persons` `p`
INNER JOIN `case_parties` `cp` ON `cp`.`person_id` = `p`.`id`
INNER JOIN `case_assignments` `ca` ON `ca`.`case_id` = `cp`.`case_id`
LEFT JOIN `custody_records` `cr` ON `cr`.`person_id` = `p`.`id` AND `cr`.`custody_status` IN ("in_custody", "bailed")
WHERE `ca`.`investigator_id` = '30'
AND `ca`.`status` = 'active'
GROUP BY `p`.`id`
ORDER BY `investigator_cases` DESC
SELECT `c`.`id`, `c`.`case_number`, `c`.`crime_type`, `c`.`status`, `c`.`priority`, `c`.`created_at`, `cp`.`party_role`
FROM `cases` `c`
JOIN `case_parties` `cp` ON `cp`.`case_id` = `c`.`id`
JOIN `case_assignments` `ca` ON `ca`.`case_id` = `c`.`id`
WHERE `cp`.`person_id` = '41'
AND `ca`.`investigator_id` = '30'
AND `ca`.`status` = 'active'
SELECT COUNT(*) AS `numrows`
FROM `cases` `c`
JOIN `case_parties` `cp` ON `cp`.`case_id` = `c`.`id`
WHERE `cp`.`person_id` = '41'
AND `cp`.`party_role` = 'accused'
AND `c`.`status` = 'closed'