app/Filters/AuthFilter.php

            // Verify token in database
            $sessionModel = model('App\Models\UserSessionModel');
            $tokenHash = hash('sha256', $token);
            $session = $sessionModel->where('token_hash', $tokenHash)
                                   ->where('user_id', $decoded->user_id)
                                   ->where('expires_at >', date('Y-m-d H:i:s'))
                                   ->first();
---
SELECT *
FROM `user_sessions`
WHERE `token_hash` = '1b5b0c676660af6c603f9e8dffaeb4045d700d054a5f709f0c05fd0739e2e550'
AND `user_id` = '30'
AND `expires_at` > '2026-01-20 20:46:14'
 LIMIT 1


            // Load user data
            $userModel = model('App\Models\UserModel');
            $user = $userModel->find($decoded->user_id);
---
SELECT *
FROM `users`
WHERE `users`.`id` = '30'