app/Controllers/AuthController.php

SELECT *
FROM `users`
WHERE `username` = 'kazama'
 LIMIT 1
---
    public function login()
    {
        try {
            $rules = [
                'username' => 'required',
                'password' => 'required'
            ];

            if (!$this->validate($rules)) {
                return $this->fail($this->validator->getErrors(), 400);
            }

            $username = $this->request->getPost('username');
            $password = $this->request->getPost('password');

            log_message('info', "Login attempt for username: {$username}");

            $userModel = model('App\Models\UserModel');
            $userModel->skipValidation(true); // Skip validation for login lookup
            $user = $userModel->where('username', $username)->first();