app/Controllers/DashboardController.php

                ->countAllResults();
        } elseif ($role === 'investigator') {
            // Investigator sees assigned cases
            $stats['assigned_cases'] = $db->table('case_assignments')
                ->where('investigator_id', $userId)
                ->where('status', 'active')
                ->countAllResults();
            $stats['completed_cases'] = $db->table('case_assignments')
                ->where('investigator_id', $userId)
                ->where('status', 'completed')
                ->countAllResults();
            $stats['pending_reports'] = $db->table('cases')
                ->join('case_assignments', 'case_assignments.case_id = cases.id')
                ->where('case_assignments.investigator_id', $userId)
                ->where('cases.status', 'investigating')
                ->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `case_assignments`
WHERE `investigator_id` = '30'
AND `status` = 'active'
SELECT COUNT(*) AS `numrows`
FROM `case_assignments`
WHERE `investigator_id` = '30'
AND `status` = 'completed'
SELECT COUNT(*) AS `numrows`
FROM `cases`
JOIN `case_assignments` ON `case_assignments`.`case_id` = `cases`.`id`
WHERE `case_assignments`.`investigator_id` = '30'
AND `cases`.`status` = 'investigating'

    private function getCasesByStatusFiltered($centerId, $userId, $role)
    {
        $db = \Config\Database::connect();
        $builder = $db->table('cases')
            ->select('cases.status, COUNT(*) as count')
            ->where('cases.center_id', $centerId);

        // Admin can only see cases they created + cases created by OB officers
        if ($role === 'admin') {
            $builder->join('users', 'users.id = cases.created_by', 'left')
                ->groupStart()
                    ->where('cases.created_by', $userId)
                    ->orWhere('users.role', 'ob_officer')
                ->groupEnd();
        }

        $result = $builder->groupBy('cases.status')
            ->get()
            ->getResultArray();
---
SELECT `cases`.`status`, COUNT(*) as count
FROM `cases`
WHERE `cases`.`center_id` = '8'
GROUP BY `cases`.`status`