app/Controllers/NotificationController.php

    public function index()
    {
        $userId = $this->request->userId;
        $notificationModel = model('App\Models\NotificationModel');

        $notifications = $notificationModel->where('user_id', $userId)
            ->orderBy('created_at', 'DESC')
            ->limit(50)
            ->findAll();
---
SELECT *
FROM `notifications`
WHERE `user_id` = '30'
ORDER BY `created_at` DESC
 LIMIT 50