app/Models/CaseModel.php

    public function getCasesSolvedByInvestigator(int $investigatorId, string $role)
    {
        $db = \Config\Database::connect();

        $builder = $db->table('cases')
            ->select('cases.*, police_centers.center_name, police_centers.center_code,
                     users.full_name as closed_by_name, users.badge_number,
                     case_assignments.assigned_at')
            ->join('police_centers', 'police_centers.id = cases.center_id', 'left')
            ->join('users', 'users.id = cases.closed_by', 'left')
            ->join('case_assignments', 'case_assignments.case_id = cases.id', 'left')
            ->where('cases.status', 'closed')
            ->where('cases.court_status', 'not_sent')
            ->orderBy('cases.closed_date', 'DESC');

        // If investigator role, only show their solved cases
        if (!in_array($role, ['admin', 'super_admin'])) {
            $builder->where('case_assignments.investigator_id', $investigatorId);
        }

        return $builder->get()->getResultArray();
---
SELECT `cases`.*, `police_centers`.`center_name`, `police_centers`.`center_code`, `users`.`full_name` as `closed_by_name`, `users`.`badge_number`, `case_assignments`.`assigned_at`
FROM `cases`
LEFT JOIN `police_centers` ON `police_centers`.`id` = `cases`.`center_id`
LEFT JOIN `users` ON `users`.`id` = `cases`.`closed_by`
LEFT JOIN `case_assignments` ON `case_assignments`.`case_id` = `cases`.`id`
WHERE `cases`.`status` = 'closed'
AND `cases`.`court_status` = 'not_sent'
AND `case_assignments`.`investigator_id` = 30
ORDER BY `cases`.`closed_date` DESC

    public function getFullCaseDetails(int $caseId)
    {
        $case = $this->find($caseId);
        if (!$case) {
            return null;
        }

        $db = \Config\Database::connect();

        // Get center details
        $case['center'] = $db->table('police_centers')
            ->where('id', $case['center_id'])
            ->get()
            ->getRowArray();

        // Get case parties
        $case['parties'] = $db->table('case_parties')
            ->select('case_parties.*, persons.*')
            ->join('persons', 'persons.id = case_parties.person_id')
            ->where('case_parties.case_id', $caseId)
            ->get()
            ->getResultArray();

        // Get assigned investigators
        $case['investigators'] = $db->table('case_assignments')
            ->select('case_assignments.*, users.full_name, users.badge_number, users.email')
            ->join('users', 'users.id = case_assignments.investigator_id')
            ->where('case_assignments.case_id', $caseId)
            ->where('case_assignments.status', 'active')
            ->get()
            ->getResultArray();

        // Get evidence count
        $case['evidence_count'] = $db->table('evidence')
            ->where('case_id', $caseId)
            ->countAllResults();
---
SELECT *
FROM `cases`
WHERE `cases`.`id` = 13
SELECT *
FROM `police_centers`
WHERE `id` = '8'
SELECT `case_parties`.*, `persons`.*
FROM `case_parties`
JOIN `persons` ON `persons`.`id` = `case_parties`.`person_id`
WHERE `case_parties`.`case_id` = 13
SELECT `case_assignments`.*, `users`.`full_name`, `users`.`badge_number`, `users`.`email`
FROM `case_assignments`
JOIN `users` ON `users`.`id` = `case_assignments`.`investigator_id`
WHERE `case_assignments`.`case_id` = 13
AND `case_assignments`.`status` = 'active'
SELECT COUNT(*) AS `numrows`
FROM `evidence`
WHERE `case_id` = 13