app/Models/InvestigationNoteModel.php

SELECT `investigation_notes`.*, `users`.`full_name` as `investigator_name`, `editors`.`full_name` as `last_editor_name`
FROM `investigation_notes`
JOIN `users` ON `users`.`id` = `investigation_notes`.`investigator_id`
LEFT JOIN `users` as `editors` ON `editors`.`id` = `investigation_notes`.`last_edited_by`
WHERE `investigation_notes`.`case_id` = 35
AND `investigation_notes`.`person_id` = 40
ORDER BY `investigation_notes`.`created_at` DESC
---
    public function getPersonNotes(int $caseId, int $personId)
    {
        return $this->select('investigation_notes.*, users.full_name as investigator_name,
                             editors.full_name as last_editor_name')
            ->join('users', 'users.id = investigation_notes.investigator_id')
            ->join('users as editors', 'editors.id = investigation_notes.last_edited_by', 'left')
            ->where('investigation_notes.case_id', $caseId)
            ->where('investigation_notes.person_id', $personId)
            ->orderBy('investigation_notes.created_at', 'DESC')
            ->findAll();