app/Models/InvestigatorConclusionModel.php

SELECT *
FROM `investigator_conclusions`
WHERE `case_id` = '13'
AND `investigator_id` = '30'
ORDER BY `updated_at` DESC
---
    public function getConclusionByCase($caseId, $investigatorId = null)
    {
        $builder = $this->builder();
        $builder->where('case_id', $caseId);

        if ($investigatorId) {
            $builder->where('investigator_id', $investigatorId);
        }

        $builder->orderBy('updated_at', 'DESC');
        return $builder->get()->getRowArray();