app/Models/PoliceCenterModel.php

    public function getCenterStats(int $centerId)
    {
        $db = \Config\Database::connect();

        $stats = [
            'total_users' => $db->table('users')
                ->where('center_id', $centerId)
                ->where('is_active', 1)
                ->countAllResults(),

            'total_cases' => $db->table('cases')
                ->where('center_id', $centerId)
                ->countAllResults(),

            'active_cases' => $db->table('cases')
                ->where('center_id', $centerId)
                ->whereIn('status', ['investigating', 'assigned', 'approved'])
                ->countAllResults(),

            'in_custody' => $db->table('custody_records')
                ->where('center_id', $centerId)
                ->where('custody_status', 'in_custody')
                ->countAllResults()
---
SELECT COUNT(*) AS `numrows`
FROM `users`
WHERE `center_id` = 1
AND `is_active` = 1
SELECT COUNT(*) AS `numrows`
FROM `cases`
WHERE `center_id` = 1
SELECT COUNT(*) AS `numrows`
FROM `cases`
WHERE `center_id` = 1
AND `status` IN ('investigating','assigned','approved')
SELECT COUNT(*) AS `numrows`
FROM `custody_records`
WHERE `center_id` = 1
AND `custody_status` = 'in_custody'