app/Models/ReportSettingsModel.php

    public function getSetting($key, $centerId = null)
    {
        $builder = $this->where('setting_key', $key)
                       ->where('is_active', 1);

        if ($centerId) {
            // Try to get center-specific setting first
            $centerSetting = $builder->where('center_id', $centerId)->first();
            if ($centerSetting) {
                return $this->parseSettingValue($centerSetting);
            }
        }

        // Fall back to system-wide setting
        $systemSetting = $this->where('setting_key', $key)
                             ->where('center_id', null)
                             ->where('is_active', 1)
                             ->first();
---
SELECT *
FROM `report_settings`
WHERE `setting_key` = 'header_image'
AND `is_active` = 1
AND `setting_key` = 'header_image'
AND `center_id` IS NULL
AND `is_active` = 1
 LIMIT 1