app/Models/UserSessionModel.php

INSERT INTO `user_sessions` (`user_id`, `token_hash`, `refresh_token_hash`, `ip_address`, `user_agent`, `expires_at`, `created_at`) VALUES (30, 'cfe5333c1a89b33fe3101867ea4b7bfdaf2c8a9e5202d4ae5dd2c8a322001078', 'e658b6bc87a4a24ef29f830c826ad15fa4be3ab34d27e4bb2e9d5dc4b70570b7', '::1', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/143.0.0.0 Safari/537.36', '2026-01-21 12:00:26', '2026-01-21 11:30:26')
---
    public function createSession(int $userId, string $token, string $refreshToken, array $metadata = [])
    {
        $expiresAt = date('Y-m-d H:i:s', strtotime('+30 minutes'));

        $data = [
            'user_id' => $userId,
            'token_hash' => hash('sha256', $token),
            'refresh_token_hash' => hash('sha256', $refreshToken),
            'ip_address' => $metadata['ip_address'] ?? null,
            'user_agent' => $metadata['user_agent'] ?? null,
            'expires_at' => $expiresAt,
            'created_at' => date('Y-m-d H:i:s') // Explicitly set created_at
        ];

        log_message('info', 'Creating session for user: ' . $userId . ' with data: ' . json_encode($data));

        // Use query builder directly to bypass model issues
        $db = \Config\Database::connect();
        try {
            $result = $db->table($this->table)->insert($data);