app/Models/UserModel.php

    public function updateLastLogin(int $userId)
    {
        try {
            $this->skipValidation(true);
            return $this->update($userId, [
                'last_login' => date('Y-m-d H:i:s'),
                'failed_login_attempts' => 0,
                'locked_until' => null
            ]);
---
UPDATE `users` SET `last_login` = '2026-01-21 11:30:26', `failed_login_attempts` = 0, `locked_until` = NULL, `updated_at` = '2026-01-21 11:30:26'
WHERE `users`.`id` IN (30)

    public function isLocked(int $userId): bool
    {
        $user = $this->find($userId);
---
SELECT *
FROM `users`
WHERE `users`.`id` = 30