app/Controllers/OB/CaseController.php

SELECT *
FROM `cases`
WHERE `created_by` = '31'
ORDER BY `created_at` DESC
---
    public function index()
    {
        $caseModel = model('App\Models\CaseModel');
        // Get user data from global (set by AuthFilter)
        $userId = $GLOBALS['current_user']['userId'] ?? $this->request->userId ?? null;
        $role = $GLOBALS['current_user']['userRole'] ?? $this->request->userRole ?? null;

        // OB officers can only see their own cases
        if ($role === 'ob_officer') {
            $cases = $caseModel->where('created_by', $userId)
                               ->orderBy('created_at', 'DESC')
                               ->findAll();